from style import *
import webbrowser
import subprocess
import sys
import time

note = MainColor2(r"""                           
π∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞               
∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞              
∞∞√                                                                     ∞∞=÷≠≈≠∞π        
∞∞√                                                                     ≠×××÷=≠≠≠=≠√     
∞∞√                                                                    ÷××××××÷≠≠=≠≠≠≈   
∞∞√                                                                  π××××××××××÷==≠≠=≠≈ 
∞∞√                                                                ππ÷×××××××××××××÷=≠==≠
∞∞√                                                               √π√√=×××××××××××××××÷==
∞∞√      ππππππππππππππππ    πππππππππππππππ                    π∞∞√π√∞√÷××××××××××××××××
∞∞√                                                            π√√√∞∞ππ√∞√÷××××××××××××××
∞∞√                                                            ∞∞√ππ√∞√√π√√√≠×××××××××××≈
∞∞√                                                           √√√∞∞√ππ√∞√√ππ√∞√≠÷××××××√ 
∞∞√                                                         π√√√√∞∞∞∞√√∞∞∞∞∞∞√√∞∞∞√≠÷=   
∞∞√                                                        √√√√√√√∞√∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞√   
∞∞√                                                      π√√√√√√√∞√√√√∞∞∞∞∞∞∞∞∞∞∞∞∞∞√    
∞∞√                                                     π√√√√√√√∞√√√√√√√√∞∞∞∞∞∞∞∞∞∞π     
∞∞√      πππππππππππππππππππππππππ           ππππππππππ√√√√√√√∞∞√√√√√√√√≠=≠≈√√∞∞∞∞       
∞∞√                                                   √√√√√√√∞√√√√√√√√√≠=≈∞∞∞≈≈√         
∞∞√                                                 π√√√√√√√∞√√√√√√√√∞=≠∞∞∞∞∞∞π          
∞∞√                                                √√√√√√√∞∞√√√√√√√√≈=≠∞∞∞∞∞√            
∞∞√                                               √√√√√√√∞∞√√√√√√√√≈≠≈∞∞∞∞∞√             
∞∞√                                              √√√√√√√∞√√√√√√√√√≠≠∞∞∞∞∞∞√              
∞∞√       ππππππππππππππππ          πππππππ  π √√√√√√√∞∞√√√√√√√√∞=≠∞∞∞∞∞∞√∞              
∞∞√                                           √√√√√√√∞∞√√√√√√√√≈=≈∞∞∞∞∞√∞∞∞              
∞∞√                                          √√√√√√√≈√√√√√√√√√≠≠≈∞∞∞∞∞π ∞∞∞              
∞∞√                                        π√√√√√√√∞√√√√√√√√√=≠∞∞∞∞∞√π  ∞∞∞              
∞∞√                                       √√√√√√√∞∞√√√√√√√√≈=≈∞∞∞∞∞√    ∞∞∞              
∞∞√                                      √√√√√√√∞∞√√√√√√√√≠=∞∞∞∞∞∞√     ∞∞∞              
∞∞√                ππππ√πππππππππππππππ√√√√√√√√∞√√√√√√√√∞≠≠∞∞∞∞∞√π      ∞∞∞              
∞∞√      π      π                     √√√√√√√√∞√√√√√√√√∞=≈∞∞∞∞∞√        ∞∞∞              
∞∞√                                  √√√√√√√∞√√√√√√√√√≈=≈∞∞∞∞∞√         ∞∞∞              
∞∞√                                 √√√√√√√∞√√√√√√√√√=≠∞∞∞∞∞√√          ∞∞∞              
∞∞√                                √√√√√√∞∞√√√√√√√√≈=≠∞∞∞∞∞√            ∞∞∞              
∞∞√                                √√√√√∞∞√√√√√√√√≈≠≈∞∞∞√∞√             ∞∞∞              
∞∞√        πππππ      πππππ        π√√√√√√√√√√√√√≠≠≈∞∞∞∞∞√√∞∞√√√√       ∞∞∞              
∞∞√      π       ππππ             πππππ√√√√√√√√∞=≠∞∞∞∞∞√π     π         ∞∞∞              
∞∞√                               ππππππ√√√√√√≈=≈∞∞∞∞∞√                 ∞∞∞              
∞∞√                               ππππππ ππ√√√√∞∞∞∞∞∞√                  ∞∞∞              
∞∞√                               ππππππππππππ π√√√√π                   ∞∞∞              
∞∞√                             √∞πππππππππππππππ                       ∞∞∞              
∞∞√                             ≠×∞ππππππππππ                           ∞∞∞              
∞∞√                             ÷×××≈πππππ                              ∞∞∞              
∞∞√                            √×××××××≠π                               ∞∞∞              
∞∞√     ππ    πππππππ   πππππππ≠××××≠π                                  ∞∞∞              
∞∞√                                                                     ∞∞∞              
∞∞√                                                                     ∞∞∞              
∞∞√                                                                     ∞∞∞              
∞∞√                                                                     ∞∞∞              
∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞∞                       
""")
Slow(note)
print(f'''
{green}Select options below:
{lc}=========================================================================||
{purple}Current options for flashcards:                                     
{cyan}[{white}1{cyan}]{yellow} Website {green} (notion) 
{cyan}[{white}2{cyan}]{yellow} inbuilt  {yellow}(notepad/windows only)
{cyan}[{white}3{cyan}]{red} Exit app                                      
{lc}=========================================================================||

''')

x = input(f'{yellow}Enter option {blue}(1,2,3):{red} ')
def website():
    print(f'{yellow}Opening web browser:')
    webbrowser.open("https://www.notion.com/")
    print(f'{green}Success!')

def inbuilt():
    print(f'{yellow}Starting notepad.exe!')
    subprocess.Popen(["notepad.exe"])


if x in ['1', 'one', 'first']:
    website()
elif x in ['2', 'two', 'second']:
    inbuilt()
elif x in ['3', 'three', 'ThREE', 'exit']:
    sys.exit()
else:
  print(f'{red}INVALID OPTION FOR FLASHCARDS!')
